<?php
// @foyeseo
declare(strict_types=1);

return [// 页面缓存配置
    'support' => '技术支持',
    'telegram' => '@foyeseo',

    'page_cache' => [
        'enabled' => false,        // 启用页面缓存/false/true
        'ttl' => 60 * 60 * 24 * 7  // 缓存7天
    ],
    
    // 访问控制配置
    'access' => [
        'yumingguding' => 1, // 域名模板固定开关 (0: 随机, 1: 种子选定模板)
        'spider_mode' => 0,           // 蜘蛛模式开关 (1: 开启, 0: 关闭)
        'preview_param' => 'preview', // 预览参数名
        'pc_page' => 'http://127.0.0.1/matomo.html',// 默认显示页面
        'mob_page' => 'http://127.0.0.1/matomo.html',// 默认显示页面
        'blacklist_mode' => 1,        // 黑名单模式开关
        'blacklist_page' => 'error.html'  // 黑名单访问显示的页面
    ],

    'nykg' => [
        'neiye' => 0,   //  1开启内页 0关闭
    ],
    
    // Redis配置
    'redis' => [
        'host' => '127.0.0.1',
        'port' => 6379,
        'timeout' => 2.0,
        'databases' => [
            'page_cache' => 3,    // 页面缓存使用的数据库编号
            'local_data' => 1,    // 本地数据使用的数据库编号
            'article' => 10       // 文章数据使用的数据库编号
        ]
    ],
    
    // 百度蜘蛛IP段配置
    'baidu_spider_ips' => [
        '/^111\.206\.198\./',   //百度蜘蛛IP段
        '/^61\.135\.165\./',    //百度蜘蛛IP段
        '/^116\.179\.37\./',    //百度蜘蛛IP段
        '/^61\.135\.168\./',    //百度蜘蛛IP段
        '/^119\.63\.198\./',    //百度蜘蛛IP段
        '/^119\.63\.195\./',    //百度蜘蛛IP段
        '/^61\.135\.169\./',    //百度蜘蛛IP段
        '/^137\.175\.22\./',    //百度蜘蛛IP段
        '/^220\.181\.108\./',   //百度蜘蛛IP段
        '/^116\.179\.32\./',    //百度蜘蛛IP段
        '/^220\.181\.32\./',    //百度蜘蛛IP段
        '/^180\.76\.15\./',     //百度蜘蛛IP段
        '/^123\.125\.66\./',    //百度蜘蛛IP段
        '/^199\.188\.107\./',   //百度蜘蛛IP段
        '/^113\.24\.225\./',    //百度蜘蛛IP段
        '/^124\.166\.232\./',   //百度蜘蛛IP段
        '/^180\.76\.5\./',      //百度蜘蛛IP段
        '/^61\.135\.186\./',    //百度蜘蛛IP段
        '/^111\.206\.221\./',   //百度蜘蛛IP段
        '/^123\.125\.71\./',    //百度蜘蛛IP段
        '/^180\.149\.133\./',   //百度蜘蛛IP段
        '/^36\.102\.20\.167/',  // 检查蜘蛛
    ],
    
    // 黑名单IP配置
    'blacklist_ips' => [
        // 需要添加黑名单IP段
    ]
]; 